In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

# 1. Cities in Sweden

In [9]:
cities = dict(Malmö=347949, Stockholm=975551, Uppsala=233839, Göteborg=583056 )
series_cities = pd.Series(cities)

In [23]:
df = pd.DataFrame(series_cities)
df= df.rename(columns={0: "Population", -1:"City"})
print(df)

           Population
Malmö          347949
Stockholm      975551
Uppsala        233839
Göteborg       583056

In [43]:
print(df.loc["Göteborg"])

Population    583056
Name: Göteborg, dtype: int64

In [46]:
df.sort_values(by="Population", ascending=False)

           Population
Stockholm      975551
Göteborg       583056
Malmö          347949
Uppsala        233839

In [48]:
df.sort_values(by="Population", ascending=False)[0:3]

           Population
Stockholm      975551
Göteborg       583056
Malmö          347949